perf/node_async_proxy_v1_node.txt

> perf@1.0.0 artillery
> artillery

Phase started: eigth (index: 0, duration: 1s) 14:36:12(-0500)

Phase completed: eigth (index: 0, duration: 1s) 14:36:13(-0500)

Phase started: pause (index: 1, duration: 9s) 14:36:13(-0500)

Phase completed: pause (index: 1, duration: 9s) 14:36:22(-0500)

Phase started: ninth (index: 2, duration: 1s) 14:36:22(-0500)

Phase completed: ninth (index: 2, duration: 1s) 14:36:23(-0500)

Phase started: pause (index: 3, duration: 9s) 14:36:23(-0500)

--------------------------------------
Metrics for period to: 14:36:20(-0500) (width: 1.973s)
--------------------------------------

http.codes.200: ................................................................ 25
http.request_rate: ............................................................. 25/sec
http.requests: ................................................................. 25
http.response_time:
  min: ......................................................................... 1002
  max: ......................................................................... 1017
  median: ...................................................................... 1002.4
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1022.7
http.responses: ................................................................ 25
vusers.completed: .............................................................. 25
vusers.created: ................................................................ 25
vusers.created_by_name.Root (/): ............................................... 25
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1008.9
  max: ......................................................................... 1076.6
  median: ...................................................................... 1022.7
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1043.3


Phase completed: pause (index: 3, duration: 9s) 14:36:32(-0500)

Phase started: tenth (index: 4, duration: 1s) 14:36:32(-0500)

Phase completed: tenth (index: 4, duration: 1s) 14:36:34(-0500)

Phase started: pause (index: 5, duration: 19s) 14:36:34(-0500)

--------------------------------------
Metrics for period to: 14:36:30(-0500) (width: 2.006s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 50/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 1002
  max: ......................................................................... 1046
  median: ...................................................................... 1002.4
  p95: ......................................................................... 1043.3
  p99: ......................................................................... 1043.3
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.Root (/): ............................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1010.7
  max: ......................................................................... 1069.8
  median: ...................................................................... 1043.3
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4


--------------------------------------
Metrics for period to: 14:36:40(-0500) (width: 3.193s)
--------------------------------------

http.codes.200: ................................................................ 200
http.request_rate: ............................................................. 93/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 985
  max: ......................................................................... 1162
  median: ...................................................................... 1022.7
  p95: ......................................................................... 1130.2
  p99: ......................................................................... 1153.1
http.responses: ................................................................ 200
vusers.completed: .............................................................. 200
vusers.created: ................................................................ 200
vusers.created_by_name.Root (/): ............................................... 200
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1018
  max: ......................................................................... 1191.1
  median: ...................................................................... 1043.3
  p95: ......................................................................... 1153.1
  p99: ......................................................................... 1176.4


Phase completed: pause (index: 5, duration: 19s) 14:36:53(-0500)

Phase started: first (index: 6, duration: 20s) 14:36:53(-0500)

--------------------------------------
Metrics for period to: 14:37:00(-0500) (width: 4.966s)
--------------------------------------

http.codes.200: ................................................................ 5
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 6
http.response_time:
  min: ......................................................................... 1003
  max: ......................................................................... 1012
  median: ...................................................................... 1002.4
  p95: ......................................................................... 1002.4
  p99: ......................................................................... 1002.4
http.responses: ................................................................ 5
vusers.completed: .............................................................. 5
vusers.created: ................................................................ 6
vusers.created_by_name.Root (/): ............................................... 6
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1009.1
  max: ......................................................................... 1018.6
  median: ...................................................................... 1022.7
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1022.7


Phase completed: first (index: 6, duration: 20s) 14:37:13(-0500)

Phase started: second (index: 7, duration: 10s) 14:37:13(-0500)

--------------------------------------
Metrics for period to: 14:37:10(-0500) (width: 9.026s)
--------------------------------------

http.codes.200: ................................................................ 10
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 10
http.response_time:
  min: ......................................................................... 1002
  max: ......................................................................... 1017
  median: ...................................................................... 1002.4
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1022.7
http.responses: ................................................................ 10
vusers.completed: .............................................................. 10
vusers.created: ................................................................ 10
vusers.created_by_name.Root (/): ............................................... 10
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1008.8
  max: ......................................................................... 1073.1
  median: ...................................................................... 1002.4
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1022.7


Phase completed: second (index: 7, duration: 10s) 14:37:23(-0500)

Phase started: pause (index: 8, duration: 10s) 14:37:23(-0500)

--------------------------------------
Metrics for period to: 14:37:20(-0500) (width: 9.235s)
--------------------------------------

http.codes.200: ................................................................ 31
http.request_rate: ............................................................. 4/sec
http.requests: ................................................................. 35
http.response_time:
  min: ......................................................................... 996
  max: ......................................................................... 1072
  median: ...................................................................... 1002.4
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1043.3
http.responses: ................................................................ 31
vusers.completed: .............................................................. 31
vusers.created: ................................................................ 35
vusers.created_by_name.Root (/): ............................................... 35
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1007.7
  max: ......................................................................... 1073.6
  median: ...................................................................... 1022.7
  p95: ......................................................................... 1043.3
  p99: ......................................................................... 1064.4


Phase completed: pause (index: 8, duration: 10s) 14:37:33(-0500)

Phase started: third (index: 9, duration: 10s) 14:37:33(-0500)

--------------------------------------
Metrics for period to: 14:37:30(-0500) (width: 4.673s)
--------------------------------------

http.codes.200: ................................................................ 24
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 19
http.response_time:
  min: ......................................................................... 1003
  max: ......................................................................... 1047
  median: ...................................................................... 1002.4
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1043.3
http.responses: ................................................................ 24
vusers.completed: .............................................................. 24
vusers.created: ................................................................ 19
vusers.created_by_name.Root (/): ............................................... 19
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1005.7
  max: ......................................................................... 1082.6
  median: ...................................................................... 1022.7
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4


Phase completed: third (index: 9, duration: 10s) 14:37:43(-0500)

Phase started: pause (index: 10, duration: 10s) 14:37:43(-0500)

--------------------------------------
Metrics for period to: 14:37:40(-0500) (width: 6.199s)
--------------------------------------

http.codes.200: ................................................................ 130
http.request_rate: ............................................................. 25/sec
http.requests: ................................................................. 155
http.response_time:
  min: ......................................................................... 997
  max: ......................................................................... 1068
  median: ...................................................................... 1022.7
  p95: ......................................................................... 1043.3
  p99: ......................................................................... 1064.4
http.responses: ................................................................ 130
vusers.completed: .............................................................. 130
vusers.created: ................................................................ 156
vusers.created_by_name.Root (/): ............................................... 156
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1005.1
  max: ......................................................................... 1144.3
  median: ...................................................................... 1022.7
  p95: ......................................................................... 1085.9
  p99: ......................................................................... 1107.9


Phase completed: pause (index: 10, duration: 10s) 14:37:53(-0500)

Phase started: fourth (index: 11, duration: 10s) 14:37:53(-0500)

--------------------------------------
Metrics for period to: 14:37:50(-0500) (width: 4.785s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 25/sec
http.requests: ................................................................. 95
http.response_time:
  min: ......................................................................... 1000
  max: ......................................................................... 1078
  median: ...................................................................... 1002.4
  p95: ......................................................................... 1043.3
  p99: ......................................................................... 1064.4
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 94
vusers.created_by_name.Root (/): ............................................... 94
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1004.4
  max: ......................................................................... 1095.5
  median: ...................................................................... 1022.7
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1085.9


Phase completed: fourth (index: 11, duration: 10s) 14:38:03(-0500)

Phase started: pause (index: 12, duration: 10s) 14:38:03(-0500)

--------------------------------------
Metrics for period to: 14:38:00(-0500) (width: 6.208s)
--------------------------------------

http.codes.200: ................................................................ 260
http.request_rate: ............................................................. 49/sec
http.requests: ................................................................. 301
http.response_time:
  min: ......................................................................... 997
  max: ......................................................................... 1117
  median: ...................................................................... 1022.7
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1085.9
http.responses: ................................................................ 260
vusers.completed: .............................................................. 260
vusers.created: ................................................................ 302
vusers.created_by_name.Root (/): ............................................... 302
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1008.6
  max: ......................................................................... 1132.9
  median: ...................................................................... 1043.3
  p95: ......................................................................... 1107.9
  p99: ......................................................................... 1130.2


Phase completed: pause (index: 12, duration: 10s) 14:38:13(-0500)

Phase started: fifth (index: 13, duration: 10s) 14:38:13(-0500)

--------------------------------------
Metrics for period to: 14:38:10(-0500) (width: 4.82s)
--------------------------------------

http.codes.200: ................................................................ 240
http.request_rate: ............................................................. 53/sec
http.requests: ................................................................. 199
http.response_time:
  min: ......................................................................... 972
  max: ......................................................................... 1133
  median: ...................................................................... 1022.7
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1107.9
http.responses: ................................................................ 240
vusers.completed: .............................................................. 240
vusers.created: ................................................................ 198
vusers.created_by_name.Root (/): ............................................... 198
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1008.3
  max: ......................................................................... 1178.2
  median: ...................................................................... 1043.3
  p95: ......................................................................... 1107.9
  p99: ......................................................................... 1153.1


Phase completed: fifth (index: 13, duration: 10s) 14:38:27(-0500)

Phase started: pause (index: 14, duration: 10s) 14:38:27(-0500)

--------------------------------------
Metrics for period to: 14:38:20(-0500) (width: 6.2s)
--------------------------------------

http.codes.200: ................................................................ 405
http.request_rate: ............................................................. 76/sec
http.requests: ................................................................. 474
http.response_time:
  min: ......................................................................... 981
  max: ......................................................................... 1140
  median: ...................................................................... 1022.7
  p95: ......................................................................... 1085.9
  p99: ......................................................................... 1130.2
http.responses: ................................................................ 405
vusers.completed: .............................................................. 405
vusers.created: ................................................................ 475
vusers.created_by_name.Root (/): ............................................... 475
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1006.2
  max: ......................................................................... 1185.2
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1130.2
  p99: ......................................................................... 1153.1


Phase completed: pause (index: 14, duration: 10s) 14:38:37(-0500)

Phase started: sixth (index: 15, duration: 10s) 14:38:37(-0500)

--------------------------------------
Metrics for period to: 14:38:30(-0500) (width: 8.06s)
--------------------------------------

http.codes.200: ................................................................ 595
http.request_rate: ............................................................. 75/sec
http.requests: ................................................................. 526
http.response_time:
  min: ......................................................................... 981
  max: ......................................................................... 1321
  median: ...................................................................... 1022.7
  p95: ......................................................................... 1249.1
  p99: ......................................................................... 1274.3
http.responses: ................................................................ 595
vusers.completed: .............................................................. 595
vusers.created: ................................................................ 525
vusers.created_by_name.Root (/): ............................................... 525
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1014.1
  max: ......................................................................... 1349
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1274.3
  p99: ......................................................................... 1326.4


--------------------------------------
Metrics for period to: 14:38:40(-0500) (width: 2.856s)
--------------------------------------

http.codes.200: ................................................................ 185
http.request_rate: ............................................................. 91/sec
http.requests: ................................................................. 260
http.response_time:
  min: ......................................................................... 1011
  max: ......................................................................... 1264
  median: ...................................................................... 1176.4
  p95: ......................................................................... 1249.1
  p99: ......................................................................... 1274.3
http.responses: ................................................................ 185
vusers.completed: .............................................................. 185
vusers.created: ................................................................ 261
vusers.created_by_name.Root (/): ............................................... 261
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1026.9
  max: ......................................................................... 1295.4
  median: ...................................................................... 1176.4
  p95: ......................................................................... 1274.3
  p99: ......................................................................... 1274.3